In [2]:
import numpy as np
import pandas as pd

In [6]:
filas = ['ventas1', 'ventas2', 'ventas3']
columnas = ['zonaA', 'zonaB', 'zonaC']
datos = [[123,456,789],[234,541,257],[120,451,258]]

In [8]:
dataframe = pd.DataFrame(datos,filas,columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas2    234    541    257
ventas3    120    451    258

In [10]:
dataframe.loc['ventas1']

zonaA    123
zonaB    456
zonaC    789
Name: ventas1, dtype: int64

In [12]:
dataframe.loc[['ventas1','ventas2']]

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas2    234    541    257

In [15]:
dataframe[['zonaA','zonaC']]

         zonaA  zonaC
ventas1    123    789
ventas2    234    257
ventas3    120    258

In [16]:
dataframe.loc['ventas1']['zonaA']

123

In [18]:
dataframe['ToasLasZonas'] = dataframe['zonaA'] + dataframe['zonaB'] + dataframe['zonaC']
dataframe

         zonaA  zonaB  zonaC  ToasLasZonas
ventas1    123    456    789          1368
ventas2    234    541    257          1032
ventas3    120    451    258           829

In [19]:
dataframe

         zonaA  zonaB  zonaC  ToasLasZonas
ventas1    123    456    789          1368
ventas2    234    541    257          1032
ventas3    120    451    258           829

In [21]:
dataframe.drop('ToasLasZonas',axis=1)

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas2    234    541    257
ventas3    120    451    258

In [22]:
dataframe

         zonaA  zonaB  zonaC  ToasLasZonas
ventas1    123    456    789          1368
ventas2    234    541    257          1032
ventas3    120    451    258           829

In [23]:
dataframe.drop('ToasLasZonas', axis=1, inplace=True)

In [24]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas2    234    541    257
ventas3    120    451    258

In [25]:
dataframe.drop('ventas3', axis=0) # Por defecto axis=0

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas2    234    541    257

In [26]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas2    234    541    257
ventas3    120    451    258

In [27]:
dataframe.drop('ventas3', axis=0, inplace=True) # Por defecto axis=0

In [28]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas2    234    541    257

In [29]:
dataframe.shape

(2, 3)